#include "ui.h"

/*
 * 绘制系统首页
 */
void titleUI(){
    system("clear");
    
    printf("|==========================================================|\n");
    printf("|==========================================================|\n");
    printf("|==================== 学 生 管 理 系 统 ===================|\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|     1.显示                             2.添加            |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|     3.查询                             4.修改            |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|     5.删除                             6.退出            |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|==========================================================|\n");
    timeSimple();
}

void showAllUI(){
    system("clear");
    
    printf("|==========================================================|\n");
    printf("|==========================================================|\n");
    printf("|==================== 学 生 管 理 系 统 ===================|\n");
    printf("|                                                          |\n");
    printf("|                         学生列表                         |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|        [n]:下一页     [p]:上一页     [q]:返回上一级      |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|==========================================================|\n");
    timeSimple();
}

void addUI(){
    system("clear");
    
    printf("|==========================================================|\n");
    printf("|==========================================================|\n");
    printf("|==================== 学 生 管 理 系 统 ===================|\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                         添加信息                         |\n");
    printf("|                    (按数字键切换输入条目)                |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|     1.学号:                                              |\n");
    printf("|     2.姓名:                                              |\n");
    printf("|     3.年龄:                                              |\n");
    printf("|     4.绩点:                                              |\n");
    printf("|     5.学费:                                              |\n");
    printf("|                                                          |\n");
    printf("|         [ENTER]:确定             [q]:返回上一级          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|==========================================================|\n");
    timeSimple();
}

void searchUI(){
    system("clear");
    
    printf("|==========================================================|\n");
    printf("|==========================================================|\n");
    printf("|==================== 学 生 管 理 系 统 ===================|\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                         搜索学生                         |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|       学号:                                              |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|       结果:                                              |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|         [ENTER]:确定             [q]:返回上一级          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|==========================================================|\n");
    timeSimple();
}

void updateUI(){
    system("clear");
    
    printf("|==========================================================|\n");
    printf("|==========================================================|\n");
    printf("|==================== 学 生 管 理 系 统 ===================|\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                         修改信息                         |\n");
    printf("|                    (按数字键切换输入条目)                |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|     1.学号:                                              |\n");
    printf("|     2.姓名:                                              |\n");
    printf("|     3.年龄:                                              |\n");
    printf("|     4.绩点:                                              |\n");
    printf("|     5.学费:                                              |\n");
    printf("|                                                          |\n");
    printf("|         [ENTER]:确定             [q]:返回上一级          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|==========================================================|\n");
    timeSimple();
}

void delUI(){
    system("clear");
    
    printf("|==========================================================|\n");
    printf("|==========================================================|\n");
    printf("|==================== 学 生 管 理 系 统 ===================|\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                         删除条目                         |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|       学号:                      [c]:删除全部            |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|       结果:                                              |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|         [ENTER]:确定             [q]:返回上一级          |\n");
    printf("|                                                          |\n");
    printf("|                                                          |\n");
    printf("|==========================================================|\n");
    timeSimple();
}